export const courses = [
  {
    dataId: null,
    name: "Ulbi TV",
    specialization: "- Продвинутый Frontend. В production на React",
    dates: "Время обучения - 11.2023 - 02.2024",
    project: "- shop-pizza-pet-project",
    gh: "https://github.com/Vik163/shop-pizza-pet-project",
    description: [
      "Составление плана, работа над бэкендом, вёрстка, добавление функциональности и финальные доработки.",
      "Самостоятельная работа, по результатам обучения. Реализация на основе макета figma 'онлайн-пиццерия'",
    ],
  },
  {
    dataId: "react",
    name: "Яндекс Практикум",
    specialization: "- react-разработчик",
    dates: "Время обучения - 10.2022 - 01.2023",
    project: "- react-burger",
    gh: "https://github.com/Vik163/react-burger",
    description: [
      "Составление плана, работа над бэкендом, вёрстка, добавление функциональности и финальные доработки.",
    ],
  },
  {
    dataId: "web",
    name: "Яндекс Практикум",
    specialization: "- веб-разработчик",
    dates: "Время обучения - 11.2021 - 09.2022",
    project: "- movies-explorer",
    gh: "https://github.com/Vik163/movies-explorer-frontend",
    description: [
      "Составление плана, работа над бэкендом, вёрстка, добавление функциональности и финальные доработки.",
    ],
  },
];

export const education = [
  {
    dataId: "sgtu",
    name: "Самарский Государственный Технический Университет",
    dates: "Дата окончания - 2006г.",
    specialization:
      '- Инженер по  специальности "Электропривод и автоматика промышленных установок и технологических комплексов"',
    description: ["Проектирование, выполнение и защита дипломного проекта."],
  },
  {
    dataId: "nht",
    name: "Новокуйбышевский Нефтехимический Техникум",
    dates: "Дата окончания - 1997г.",
    specialization:
      '- Техник-электрик по специальности "Монтаж и эксплуатация электрооборудования предприятий и гражданских зданий"',
    description: ["Проектирование, выполнение и защита дипломного проекта."],
  },
];
